MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_19_03/GL050001C0_40_Display.cpp
static void drawSmoothStringCentered(int centerX, int baselineY, const char *text,
                                     uint16_t color, const SmoothFont &font)
{
  drawSmoothString(centerX - smoothTextWidth(text, font) / 2,
                   baselineY, text, color, font);
}

static uint16_t targetColor(uint8_t alarmLevel)
{
  if (alarmLevel >= 3) {
    return COLOR_RED;
  }
  if (alarmLevel == 2) {
    return COLOR_ORANGE;
  }
  if (alarmLevel == 1) {
    return COLOR_WARN;
  }
  return COLOR_TEXT;
}

static void drawBatteryIcon(int x, int y, uint8_t percent, bool valid)
{
  const uint16_t border = valid ? COLOR_TEXT : COLOR_GRID;
  const uint16_t levelColor = !valid ? COLOR_GRID :
                              (percent > 50 ? COLOR_GREEN :
                               (percent > 20 ? COLOR_WARN : COLOR_RED));
  drawRectOutline(x, y, 45, 20, border);
  fillRect(x + 45, y + 6, 4, 8, border);
  // Пять сегментов соответствуют шагу 20%. При 0% все сегменты пусты,
  // при 100% заполнены все пять. Процент рассчитан по диапазону 7...12 В.
  const int segments = valid && percent > 0 ? ((percent + 19) / 20) : 0;
  for (int segment = 0; segment < 5; ++segment) {
    fillRect(x + 4 + segment * 8, y + 4, 6, 12,
             segment < segments ? levelColor : COLOR_SCREEN_BG);
  }
}

static void drawTargetTable()
{
  if (!displayState.tableVisible || displayState.trackerMessageVisible) {
    return;
  }
  static const int columnX[9] = {40, 125, 210, 295, 380, 465, 565, 690, 766};
  static const char *headers[9] = {
    "ICAO", "SQUAWK", "FLIGHT", "ALT", "SPEED",
    "COURSE", "LATITUDE", "LONGITUDE", "SIG"
  };
  for (uint8_t column = 0; column < 9; ++column) {
    drawSmoothStringCentered(columnX[column], 54, headers[column], COLOR_TEXT, FONT_TINY);
  }
  drawLine(8, 59, 792, 59, COLOR_TEXT);

  const uint8_t rows = displayState.tableTargetCount < 3 ?
                       displayState.tableTargetCount : 3;
  for (uint8_t row = 0; row < rows; ++row) {
    const GL050001C0_40_Target &target = displayState.tableTargets[row];
    const int baseline = 76 + row * 20;
    const uint16_t color = COLOR_TEXT;
    char buffer[32];
    snprintf(buffer, sizeof(buffer), "%06lX", (unsigned long)(target.address & 0xFFFFFFUL));
    drawSmoothStringCentered(columnX[0], baseline, buffer, color, FONT_TINY);
    if (target.squawk != 0) {
      snprintf(buffer, sizeof(buffer), "%u", (unsigned)target.squawk);
      drawSmoothStringCentered(columnX[1], baseline, buffer, color, FONT_TINY);
    }
    drawSmoothStringCentered(columnX[2], baseline,
                             target.callsign[0] ? target.callsign : "--------",
                             color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%d", (int)target.altitudeM);
    drawSmoothStringCentered(columnX[3], baseline, buffer, color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%u", (unsigned)target.speedKmh);
    drawSmoothStringCentered(columnX[4], baseline, buffer, color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%03u", (unsigned)target.courseDeg);
    drawSmoothStringCentered(columnX[5], baseline, buffer, color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%.5f", target.latitude);
    drawSmoothStringCentered(columnX[6], baseline, buffer, color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%.5f", target.longitude);
    drawSmoothStringCentered(columnX[7], baseline, buffer, color, FONT_TINY);
    if (target.signalRssi != 0) {
      snprintf(buffer, sizeof(buffer), "%d", (int)target.signalRssi);
    } else {
      snprintf(buffer, sizeof(buffer), "--");
    }
    drawSmoothStringCentered(columnX[8], baseline, buffer, color, FONT_TINY);
  }
}

static uint16_t chooseRadarRangeMeters()
{
  if (displayState.radarRangeM != 0) {
    return displayState.radarRangeM;
  }
  uint32_t nearest = 64000;
  for (uint8_t index = 0; index < displayState.targetCount; ++index) {
    const uint32_t distance = displayState.targets[index].distanceM;
    if (distance > 0 && distance < nearest) {
      nearest = distance;
    }
  }
  if (nearest > 16000) return 32000;
  if (nearest >  8000) return 16000;
  if (nearest >  4000) return  8000;
  if (nearest >  2000) return  4000;
  if (nearest >  1000) return  2000;
  return 1000;
}

static void drawRadar()
{
  static const float DEG_TO_RAD_LOCAL = 0.01745329252f;
  const int centerX = 400;
  const int centerY = 360;
  const int outerRadius = 350;
  const int targetRadius = 336;
  const uint16_t rangeMeters = chooseRadarRangeMeters();

  drawCircle(centerX, centerY, 180, COLOR_GRID);
  drawLine(centerX - 8, centerY, centerX + 8, centerY, COLOR_GRID);
  drawLine(centerX, centerY - 8, centerX, centerY + 8, COLOR_GRID);

  // Полная замена pushRotated(): шкала компаса математически вращается на
  // отрицательный курс собственного самолёта. Сам самолёт остаётся по центру.
  for (int bearing = 0; bearing < 360; bearing += 10) {
    const float radians = (bearing - (int)displayState.courseDeg) * DEG_TO_RAD_LOCAL;
    const int outerX = centerX + (int)lroundf(sinf(radians) * outerRadius);
    const int outerY = centerY - (int)lroundf(cosf(radians) * outerRadius);
    const int tickLength = (bearing % 30 == 0) ? 14 : 6;
    const int innerX = centerX + (int)lroundf(sinf(radians) * (outerRadius - tickLength));
    const int innerY = centerY - (int)lroundf(cosf(radians) * (outerRadius - tickLength));
    drawLine(innerX, innerY, outerX, outerY, COLOR_GRID);
  }

  static const char *cardinalText[4] = {"N", "E", "S", "W"};
  static const int cardinalBearing[4] = {0, 90, 180, 270};
  for (int cardinal = 0; cardinal < 4; ++cardinal) {
    const float radians = (cardinalBearing[cardinal] - (int)displayState.courseDeg) *
                          DEG_TO_RAD_LOCAL;
    const int labelRadius = outerRadius - 25;
    const int labelX = centerX + (int)lroundf(sinf(radians) * labelRadius);
    const int labelY = centerY - (int)lroundf(cosf(radians) * labelRadius) + 8;
    drawSmoothStringCentered(labelX, labelY, cardinalText[cardinal],
                             COLOR_GRID, FONT_MEDIUM);
  }

  drawLine(centerX - 1, centerY - 15, centerX - 1, centerY + 12, COLOR_OWN_AIRCRAFT);
  drawLine(centerX, centerY - 15, centerX, centerY + 12, COLOR_OWN_AIRCRAFT);
  drawLine(centerX + 1, centerY - 15, centerX + 1, centerY + 12, COLOR_OWN_AIRCRAFT);
  drawLine(centerX - 14, centerY - 3, centerX + 12, centerY - 3, COLOR_OWN_AIRCRAFT);
  drawLine(centerX - 18, centerY - 1, centerX + 17, centerY - 1, COLOR_OWN_AIRCRAFT);
  drawLine(centerX - 8, centerY + 12, centerX + 8, centerY + 12, COLOR_OWN_AIRCRAFT);

  char rangeText[20];
  snprintf(rangeText, sizeof(rangeText), "%u km", (unsigned)(rangeMeters / 1000));
  // Исходная рамка (216,302,56,17), масштаб 1,5 и горизонтальное поле 40 px.
  drawRectOutline(364, 453, 84, 26, COLOR_RED);
  drawSmoothStringCentered(406, 473, rangeText, COLOR_TEXT, FONT_SMALL);

