MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_19_03/GL050001C0_40_Display.cpp
  if (displayState.gnssStatusVisible && displayState.baseConnected &&
      !displayState.trackerMessageVisible) {
    fillRect(165, 190, 470, 95, COLOR_SCREEN_BG);
    drawRectOutline(165, 190, 470, 95, COLOR_WARN);
    drawSmoothStringCentered(400, 228, "ОПРЕДЕЛЕНИЕ МЕСТОПОЛОЖЕНИЯ",
                             COLOR_WARN, FONT_SMALL);
    drawSmoothStringCentered(400, 260, "ОЖИДАЙТЕ", COLOR_WARN, FONT_SMALL);
  }

  if (!displayState.baseConnected) {
    drawSmoothStringCentered(400, 245, "НЕТ СВЯЗИ С БАЗОЙ", COLOR_RED, FONT_LARGE);
  }

  if (displayState.sosActive) {
    fillRect(300, 275, 200, 78, COLOR_SCREEN_BG);
    drawRectOutline(300, 275, 200, 78, COLOR_WARN);
    drawSmoothStringCentered(400, 329, "SOS", COLOR_WARN, FONT_MEDIUM);
  }
}

static bool IRAM_ATTR onRgbVsync(esp_lcd_panel_handle_t panelHandle,
                                const esp_lcd_rgb_panel_event_data_t *eventData,
                                void *userContext)
{
  (void)panelHandle;
  (void)eventData;
  (void)userContext;
  BaseType_t taskWoken = pdFALSE;
  if (vsyncSemaphore != NULL) {
    xSemaphoreGiveFromISR(vsyncSemaphore, &taskWoken);
  }
  return taskWoken == pdTRUE;
}

static void waitForVsync()
{
  if (vsyncSemaphore == NULL) {
    return;
  }
  xSemaphoreTake(vsyncSemaphore, 0);
  xSemaphoreTake(vsyncSemaphore, pdMS_TO_TICKS(100));
}

static void flushBand(int y, int height)
{
  if (!ready || panel == NULL || frameBuffer == NULL || height <= 0) {
    return;
  }
  if (y < 0) {
    height += y;
    y = 0;
  }
  if (y + height > LCD_HEIGHT) {
    height = LCD_HEIGHT - y;
  }
  if (height <= 0) {
    return;
  }

  waitForVsync();
  esp_lcd_panel_draw_bitmap(panel, 0, y, LCD_WIDTH, y + height,
                            frameBuffer + y * LCD_WIDTH);
}

static void flushFrame()
{
  flushBand(0, LCD_HEIGHT);
}

static const uint8_t *glyphFor(char c)
{
  static const uint8_t space[7] = {0, 0, 0, 0, 0, 0, 0};
  static const uint8_t dash[7] = {0, 0, 0, 0x1F, 0, 0, 0};
  static const uint8_t colon[7] = {0, 0x04, 0x04, 0, 0x04, 0x04, 0};
  static const uint8_t dot[7] = {0, 0, 0, 0, 0, 0x0C, 0x0C};
  static const uint8_t underscore[7] = {0, 0, 0, 0, 0, 0, 0x1F};
  static const uint8_t leftParen[7] = {0x02, 0x04, 0x08, 0x08, 0x08, 0x04, 0x02};
  static const uint8_t rightParen[7] = {0x08, 0x04, 0x02, 0x02, 0x02, 0x04, 0x08};
  static const uint8_t zero[7] = {0x0E, 0x11, 0x13, 0x15, 0x19, 0x11, 0x0E};
  static const uint8_t one[7] = {0x04, 0x0C, 0x04, 0x04, 0x04, 0x04, 0x0E};
  static const uint8_t two[7] = {0x0E, 0x11, 0x01, 0x02, 0x04, 0x08, 0x1F};
  static const uint8_t three[7] = {0x1E, 0x01, 0x01, 0x0E, 0x01, 0x01, 0x1E};
  static const uint8_t four[7] = {0x02, 0x06, 0x0A, 0x12, 0x1F, 0x02, 0x02};
  static const uint8_t five[7] = {0x1F, 0x10, 0x10, 0x1E, 0x01, 0x01, 0x1E};
  static const uint8_t six[7] = {0x0E, 0x10, 0x10, 0x1E, 0x11, 0x11, 0x0E};
  static const uint8_t seven[7] = {0x1F, 0x01, 0x02, 0x04, 0x08, 0x08, 0x08};
  static const uint8_t eight[7] = {0x0E, 0x11, 0x11, 0x0E, 0x11, 0x11, 0x0E};
  static const uint8_t nine[7] = {0x0E, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x0E};
  static const uint8_t letters[26][7] = {
    {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11},
    {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E},
    {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E},
    {0x1E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x1E},
    {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F},
    {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x10},
    {0x0E, 0x11, 0x10, 0x17, 0x11, 0x11, 0x0F},
    {0x11, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11},
    {0x0E, 0x04, 0x04, 0x04, 0x04, 0x04, 0x0E},
    {0x01, 0x01, 0x01, 0x01, 0x11, 0x11, 0x0E},
    {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11},
    {0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1F},
    {0x11, 0x1B, 0x15, 0x15, 0x11, 0x11, 0x11},
    {0x11, 0x19, 0x15, 0x13, 0x11, 0x11, 0x11},
    {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E},
    {0x1E, 0x11, 0x11, 0x1E, 0x10, 0x10, 0x10},
    {0x0E, 0x11, 0x11, 0x11, 0x15, 0x12, 0x0D},
    {0x1E, 0x11, 0x11, 0x1E, 0x14, 0x12, 0x11},
    {0x0F, 0x10, 0x10, 0x0E, 0x01, 0x01, 0x1E},
    {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04},
    {0x11, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E},
    {0x11, 0x11, 0x11, 0x11, 0x0A, 0x0A, 0x04},
    {0x11, 0x11, 0x11, 0x15, 0x15, 0x1B, 0x11},
    {0x11, 0x11, 0x0A, 0x04, 0x0A, 0x11, 0x11},
    {0x11, 0x11, 0x0A, 0x04, 0x04, 0x04, 0x04},
    {0x1F, 0x01, 0x02, 0x04, 0x08, 0x10, 0x1F}
  };

  if (c >= 'a' && c <= 'z') {
    c -= 32;
  }
  if (c >= 'A' && c <= 'Z') {
    return letters[c - 'A'];
  }
  switch (c) {
    case '0': return zero;
    case '1': return one;
    case '2': return two;
    case '3': return three;
    case '4': return four;
    case '5': return five;
    case '6': return six;
    case '7': return seven;
    case '8': return eight;
    case '9': return nine;
    case '-': return dash;
    case ':': return colon;
    case '.': return dot;
    case '_': return underscore;
    case '(': return leftParen;
    case ')': return rightParen;
    default: return space;
  }
}

static void drawChar(int x, int y, char c, uint16_t color, int scale)
{
  const uint8_t *glyph = glyphFor(c);
  for (int row = 0; row < 7; ++row) {
    for (int col = 0; col < 5; ++col) {
      if (glyph[row] & (1 << (4 - col))) {
        fillRect(x + col * scale, y + row * scale, scale, scale, color);
      }
    }
  }
}

static void drawText(int x, int y, const String &text, uint16_t color, int scale)
{
  int cursor = x;
  for (size_t i = 0; i < text.length(); ++i) {
    drawChar(cursor, y, text[i], color, scale);
    cursor += 6 * scale;
  }
}

static int textWidth(const String &text, int scale)
{
  if (text.length() == 0) {
    return 0;
  }
  return (int)text.length() * 6 * scale - scale;
}

static void drawTextCentered(int y, const String &text, uint16_t color, int scale)
{
  drawText((LCD_WIDTH - textWidth(text, scale)) / 2, y, text, color, scale);
}

enum CyrillicGlyph {
  CYR_A,
  CYR_V,
  CYR_D,
  CYR_E,
  CYR_ZH,
  CYR_I,
  CYR_SHORT_I,
  CYR_K,
  CYR_L,
  CYR_O,
  CYR_S,
  CYR_T,
  CYR_CH,
  CYR_YU,
  CYR_YA
};

static const uint8_t CYRILLIC_GLYPHS[][7] = {
  {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11}, // A
  {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E}, // V
  {0x0E, 0x0A, 0x0A, 0x12, 0x12, 0x1F, 0x11}, // D
  {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F}, // E
  {0x15, 0x15, 0x0E, 0x04, 0x0E, 0x15, 0x15}, // ZH
  {0x11, 0x11, 0x13, 0x15, 0x19, 0x11, 0x11}, // I
  {0x0A, 0x04, 0x11, 0x13, 0x15, 0x19, 0x11}, // SHORT I
  {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11}, // K
  {0x03, 0x05, 0x09, 0x11, 0x11, 0x11, 0x11}, // L
  {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E}, // O
  {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E}, // S
  {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04}, // T
  {0x11, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x01}, // CH
  {0x12, 0x15, 0x15, 0x1D, 0x15, 0x15, 0x12}, // YU
  {0x0F, 0x11, 0x11, 0x0F, 0x05, 0x09, 0x11}  // YA
};

