MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_19_03/GL050001C0_40_Display.cpp
static void drawCyrillicChar(int x, int y, CyrillicGlyph glyphIndex,
                             uint16_t color, int scale, bool italic)
{
  const uint8_t *glyph = CYRILLIC_GLYPHS[glyphIndex];
  for (int row = 0; row < 7; ++row) {
    const int italicOffset = italic ? (6 - row) * scale / 3 : 0;
    for (int col = 0; col < 5; ++col) {
      if (glyph[row] & (1 << (4 - col))) {
        fillRect(x + italicOffset + col * scale, y + row * scale,
                 scale, scale, color);
      }
    }
  }
}

static void drawCyrillicWordCentered(int y, const CyrillicGlyph *word,
                                     size_t length, uint16_t color, int scale)
{
  const int glyphStep = 7 * scale;
  const int width = (int)length * glyphStep - 2 * scale;
  int x = (LCD_WIDTH - width) / 2;
  for (size_t i = 0; i < length; ++i) {
    drawCyrillicChar(x, y, word[i], color, scale, true);
    x += glyphStep;
  }
}

static void drawShell()
{
  drawStartupBackground();
  drawSmoothStartupText();
  if (startupVersion.length() > 0) {
    const int width = smoothTextWidth(startupVersion.c_str(), FONT_TINY);
    drawSmoothString(778 - width, 468, startupVersion.c_str(),
                     COLOR_TEXT, FONT_TINY);
  }
  shellDrawn = true;
}

static void ensureShell()
{
  if (!shellDrawn) {
    drawShell();
  }
}

static bool topBarChanged(const GL050001C0_40_State &a,
                          const GL050001C0_40_State &b)
{
  return a.timeValid != b.timeValid || a.hour != b.hour || a.minute != b.minute ||
         a.powerValid != b.powerValid || a.batteryPercent != b.batteryPercent ||
         a.voltageV != b.voltageV || a.currentMa != b.currentMa ||
         a.showPowerVoltage != b.showPowerVoltage ||
         a.showPowerCurrent != b.showPowerCurrent ||
         a.showPowerBattery != b.showPowerBattery;
}

static bool targetTableChanged(const GL050001C0_40_State &a,
                               const GL050001C0_40_State &b)
{
  if (a.tableVisible != b.tableVisible ||
      a.trackerMessageVisible != b.trackerMessageVisible ||
      strcmp(a.trackerMessage, b.trackerMessage) != 0 ||
      a.tableTargetCount != b.tableTargetCount) {
    return true;
  }
  for (uint8_t index = 0; index < a.tableTargetCount; ++index) {
    const GL050001C0_40_Target &x = a.tableTargets[index];
    const GL050001C0_40_Target &y = b.tableTargets[index];
    if (x.address != y.address || strcmp(x.callsign, y.callsign) != 0 ||
        x.squawk != y.squawk || x.altitudeM != y.altitudeM ||
        x.speedKmh != y.speedKmh || x.courseDeg != y.courseDeg ||
        x.latitude != y.latitude || x.longitude != y.longitude ||
        x.signalRssi != y.signalRssi) {
      return true;
    }
  }
  return false;
}

static bool radarChanged(const GL050001C0_40_State &a,
                         const GL050001C0_40_State &b)
{
  if (a.baseConnected != b.baseConnected || a.sosActive != b.sosActive ||
      a.trackerMessageVisible != b.trackerMessageVisible ||
      a.gnssStatusVisible != b.gnssStatusVisible ||
      strcmp(a.trackerMessage, b.trackerMessage) != 0 ||
      a.courseDeg != b.courseDeg || a.radarRangeM != b.radarRangeM ||
      a.targetCount != b.targetCount) {
    return true;
  }
  for (uint8_t index = 0; index < a.targetCount; ++index) {
    const GL050001C0_40_Target &x = a.targets[index];
    const GL050001C0_40_Target &y = b.targets[index];
    if (x.distanceM != y.distanceM || x.bearingDeg != y.bearingDeg ||
        x.courseDeg != y.courseDeg ||
        x.relativeAltitudeM != y.relativeAltitudeM ||
        x.verticalRate != y.verticalRate ||
        x.alarmLevel != y.alarmLevel) {
      return true;
    }
  }
  return false;
}

static bool statusBlocksChanged(const GL050001C0_40_State &a,
                                const GL050001C0_40_State &b)
{
  return a.gnssValid != b.gnssValid || a.satellites != b.satellites ||
         a.latitude != b.latitude || a.longitude != b.longitude ||
         a.showLoraStatus != b.showLoraStatus ||
         a.showGpsStatus != b.showGpsStatus ||
         a.showLanStatus != b.showLanStatus ||
         a.lanReady != b.lanReady || a.lanLinkUp != b.lanLinkUp ||
         a.lanUdpWorking != b.lanUdpWorking ||
         memcmp(a.lanIp, b.lanIp, sizeof(a.lanIp)) != 0 ||
         a.lanUdpPort != b.lanUdpPort ||
         a.lanTxPackets != b.lanTxPackets || a.lanRxPackets != b.lanRxPackets ||
         a.loraTxPackets != b.loraTxPackets ||
         a.loraRxPackets != b.loraRxPackets ||
         a.loraRfHz != b.loraRfHz || a.loraRssiDb != b.loraRssiDb;
}

bool GL050001C0_40_setup()
{
#if !GL050001C0_40_PINMAP_CONFIRMED
  Serial.println(F("[GL050001C0-40] RGB panel is disabled: not enough free GPIOs in the current FlyRF pinout."));
  Serial.println(F("[GL050001C0-40] Move peripherals first, then set GL050001C0_40_PINMAP_CONFIRMED=1 and fill the pin map."));
  return false;
#else
  esp_lcd_rgb_panel_config_t config = {};
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  config.clk_src = LCD_CLK_SRC_PLL160M;
#endif
  config.data_width = 16;
  config.psram_trans_align = 64;
  config.sram_trans_align = 4;
  config.disp_gpio_num = LCD_PIN_DISP_EN;
  config.pclk_gpio_num = LCD_PIN_PCLK;
  config.vsync_gpio_num = LCD_PIN_VSYNC;
  config.hsync_gpio_num = LCD_PIN_HSYNC;
  config.de_gpio_num = LCD_PIN_DE;
  for (int i = 0; i < 16; ++i) {
    config.data_gpio_nums[i] = LCD_PIN_DATA[i];
  }
  // Снижение PCLK уменьшает нагрузку RGB DMA на PSRAM при работе Wi-Fi.
  config.timings.pclk_hz = 24000000;
  config.timings.h_res = LCD_WIDTH;
  config.timings.v_res = LCD_HEIGHT;
  config.timings.hsync_pulse_width = 64;
  config.timings.hsync_back_porch = 80;
  config.timings.hsync_front_porch = 42;
  config.timings.vsync_pulse_width = 2;
  config.timings.vsync_back_porch = 74;
  config.timings.vsync_front_porch = 1;
  config.timings.flags.pclk_active_neg = false;
  config.flags.fb_in_psram = true;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  config.num_fbs = 1;
  // Параметры стабильного теста №7: 60 строк во внутренних bounce-буферах.
  config.bounce_buffer_size_px = LCD_WIDTH * 60;
#endif

  esp_err_t err = esp_lcd_new_rgb_panel(&config, &panel);
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] panel allocation failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  vsyncSemaphore = xSemaphoreCreateBinary();
  if (vsyncSemaphore == NULL) {
    Serial.println(F("[GL050001C0-40] VSYNC semaphore allocation failed"));
    panel = NULL;
    return false;
  }
  esp_lcd_rgb_panel_event_callbacks_t callbacks = {};
  callbacks.on_vsync = onRgbVsync;
  err = esp_lcd_rgb_panel_register_event_callbacks(panel, &callbacks, NULL);
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] VSYNC callback registration failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  err = esp_lcd_panel_reset(panel);
  if (err == ESP_OK) {
    err = esp_lcd_panel_init(panel);
  }
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] panel init failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  frameBuffer = (uint16_t *)heap_caps_malloc(LCD_WIDTH * LCD_HEIGHT * sizeof(uint16_t),
                                            MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (frameBuffer == NULL) {
    Serial.println(F("[GL050001C0-40] PSRAM framebuffer allocation failed"));
    panel = NULL;
    return false;
  }

  ready = true;
  drawShell();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  Serial.println(F("[GL050001C0-40] RGB panel initialized: PCLK 24 MHz, VSYNC 2/74/1, bounce buffer 60 lines"));
#else
  Serial.println(F("[GL050001C0-40] RGB panel initialized: PCLK 24 MHz"));
#endif
  return true;
#endif
}

void GL050001C0_40_showStartup(const String &version)
{
  if (!ready) {
    return;
  }

  startupVersion = version;
  shellDrawn = false;
  drawShell();
  flushFrame();
  startupShownMs = millis();
  operationalFrameShown = false;
  renderedStateValid = false;
}

void GL050001C0_40_showStatus(uint32_t rxPackets, uint32_t txPackets)
{
  displayState.rs485RxPackets = rxPackets;
  displayState.rs485TxPackets = txPackets;
}

void GL050001C0_40_updateState(const GL050001C0_40_State &state)
{
  displayState = state;
  stateAvailable = true;
}

bool GL050001C0_40_needsFrameUpdate()
{
  return ready && stateAvailable;
}
void GL050001C0_40_showPowerOff()
{
  if (!ready) {
    return;
  }

  drawShell();
  flushFrame();
}

void GL050001C0_40_loop()
{
  const uint32_t nowMs = millis();
  if (!ready || !stateAvailable ||
      (uint32_t)(nowMs - startupShownMs) < 3000UL) {
    return;
  }

  if (!operationalFrameShown) {
    if (!Web_displayUpdateAllowed()) {
      return;
    }
    drawOperationalFrame();
    flushFrame();
    renderedState = displayState;
    renderedStateValid = true;
    operationalFrameShown = true;
    lastDisplayUpdateMs = nowMs;
    delay(1);
    return;
  }

  if (!renderedStateValid ||
      (uint32_t)(nowMs - lastDisplayUpdateMs) < DISPLAY_UPDATE_INTERVAL_MS ||
      !Web_displayUpdateAllowed()) {
    return;
  }

  const bool updateTop = topBarChanged(displayState, renderedState);
  const bool updateTable = targetTableChanged(displayState, renderedState);
  const bool updateRadar = radarChanged(displayState, renderedState);
  const bool updateStatus = statusBlocksChanged(displayState, renderedState);
  if (!updateTop && !updateTable && !updateRadar && !updateStatus) {
    return;
  }

  // При повороте поле полёта и шкала компаса затрагивают весь экран. Такой кадр
  // собирается целиком, иначе на верхней панели остаются риски старого курса.
  // Все изменения без поворота по-прежнему передаются отдельными полосами.
  if (updateRadar) {
    drawOperationalFrame();
    flushFrame();
    renderedState = displayState;
    renderedStateValid = true;
    lastDisplayUpdateMs = nowMs;
    delay(1);
    return;
  }

  if (updateTop) {
    fillRect(0, 0, LCD_WIDTH, 38, COLOR_SCREEN_BG);
    drawTopBar();
  }
  if (updateTable) {
    fillRect(0, 38, LCD_WIDTH, 88, COLOR_SCREEN_BG);
    drawTargetTable();
  }
  if (updateStatus) {
    // Нижние блоки расположены поверх шкалы радара: сначала восстанавливаем
    // фон радара, затем заново выводим только телеметрию.
    fillRect(0, 390, LCD_WIDTH, LCD_HEIGHT - 390, COLOR_SCREEN_BG);
    drawRadar();
    drawStatusBlocks();
  }

  if (updateTop) {
    flushBand(0, 38);
  }
  if (updateTable) {
    flushBand(38, 88);
  }
  if (updateStatus) {
    flushBand(390, LCD_HEIGHT - 390);
  }

  renderedState = displayState;
  renderedStateValid = true;
  lastDisplayUpdateMs = nowMs;
  delay(1);
}
